app/controllers/cart_items_controller.rb

  def create()
    @user = current_user
    item = Item.find(params[:id])
    cart_item = @user.cart.cart_items.find_by(item_id: item.id)
    if cart_item
      cart_item.quantity += 1
      cart_item.save
    else
      current_user.cart.items << item
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2 LIMIT $3  [["cart_id", 7], ["item_id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cart_items" SET "quantity" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["quantity", 2], ["updated_at", "2018-11-29 15:23:06.984886"], ["id", 5]]
INSERT INTO "cart_items" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 1], ["item_id", 1], ["created_at", "2018-11-29 15:23:04.862351"], ["updated_at", "2018-11-29 15:23:04.862351"]]

  def destroy()
    cart_item = CartItem.find(params[:id])
    cart_item.destroy
---
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 1]]