app/controllers/items_controller.rb

  def update

  	 @item= Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]